//
//  S2_Recursion.h
//  Basic Review
//
//  Created by 徐伟达 on 2018/1/14.
//  Copyright © 2018年 徐伟达. All rights reserved.
//
/*---------------------------------------------------------------------
                            第二章 任务表
 -----------------------------------------------------------------------

 ---------------------------------------------------------------------*/
#ifndef S2_Recursion_h
#define S2_Recursion_h

#include <stdio.h>
#include <stdlib.h>
//---------------------------------------------------------------------
//               数据结构与算法 第二章 递归   p31~36
//---------------------------------------------------------------------
void recursionTester(void);

#endif /* S2_Recursion_h */
