//
//  Basic.h
//  Basic Review
//
//  Created by 徐伟达 on 2017/6/17.
//  Copyright © 2017年 徐伟达. All rights reserved.
//

#ifndef Basic_h
#define Basic_h

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
//---------------------------------------------------------------------------
//                               选择器
//---------------------------------------------------------------------------
void basicSelector(int a);
//---------------------------------------------------------------------------
//                          第二章，第三章
//---------------------------------------------------------------------------
void asIf(int a);//if
void asSwitch(int a);//switch
void asFor(int a);//for
void asWhile(int a);//while
void asDoWhile(int a);//do...while
//---------------------------------------------------------------------------
//                                 第四章
//---------------------------------------------------------------------------
//                       数据类型，声明与定义，类型转换
//double 科学计数法表达
void scientificNotation();
//---------------------------------------------------------------------------
//                                 第五章
//---------------------------------------------------------------------------
//                              数组与字符串
void arrayTest();
void stringTest();
#endif /* Basic_h */
