//
//  S3_List.h
//  Basic Review
//
//  Created by 徐伟达 on 2017/12/26.
//  Copyright © 2017年 徐伟达. All rights reserved.
//
/*---------------------------------------------------------------------
							第三章 任务表
-----------------------------------------------------------------------
 ● TODO-PRO-GLO: 动态数组(p38) s4, s5, s14
 ● TODO-PRO-GLO: 内存高效的双向链表(p60) 因为XOR(排他的逻辑和)还不会暂时放一下
---------------------------------------------------------------------*/
#ifndef S3_List_h
#define S3_List_h

#include <stdio.h>
#include <stdlib.h>
//---------------------------------------------------------------------
//                    数据结构与算法 第三章 链表   p37~80
//---------------------------------------------------------------------
void listTester(void);

#endif /* S3_List_h */
