//
//  LoadData.h
//  Basic Review
//
//  Created by 徐伟达 on 2017/6/18.
//  Copyright © 2017年 徐伟达. All rights reserved.
//

#ifndef LoadData_h
#define LoadData_h

#include <stdio.h>
#include <stdlib.h>
#include "Bool.h"
#include "MemorySet.h"
#include "List.h"

//---------------------------------------------------------------------------
//                                读取命令行
//---------------------------------------------------------------------------
//-------------------------------------------------------
//                       类型定义
//-------------------------------------------------------
typedef struct {
    int a;
} DataFromCMD;

//-------------------------------------------------------
//                     管理测试的函数
//-------------------------------------------------------

#endif /* LoadData_h */
